# Dataframes testing code

In [26]:
import pandas as pd
df = pd.read_csv("Files/DisneylandReviews.csv", encoding="latin-1")
df

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

## Lookgin for data (loc tool)

### loc and iloc can return multiple data

In [27]:
df.head(6)
# Right here we can get the first 6 elements of the DF

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
5,670591897,3,2019-4,Singapore,"Have been to Disney World, Disneyland Anaheim ...",Disneyland_HongKong

In [28]:
df.tail(3)
# Right here we can get the last 3 elements of the DF

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [29]:
df.loc[[0,40000, 200]] # We can search for Rows, also I can get specific rows
# It has this structure: df.loc[[Rows],[Columns]]

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
40000,155911904,3,2013-3,United Kingdom,This was our 2nd visit. Kids didn't seem to im...,Disneyland_Paris
200,653385350,5,2019-2,United States,Much smaller than the US versions and you can ...,Disneyland_HongKong

In [30]:
df.loc[[12]]

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
12,670376905,4,2019-4,Australia,"We spend two days, the second day went early t...",Disneyland_HongKong

In [31]:
df.loc[[1],['Rating']] # We gotta put the name of the column between ''

   Rating
1       4

In [32]:
df.loc[12:20,['Reviewer_Location', 'Rating']] # In this case we didn't had to put the [Row]
# We define the range of the row in the 12:20

   Reviewer_Location  Rating
12         Australia       4
13       Philippines       5
14         Australia       5
15    United Kingdom       3
16   Myanmar (Burma)       4
17    United Kingdom       3
18         Australia       4
19         Hong Kong       5
20    United Kingdom       5

In [33]:
# We can also get every row with the next expression
df.loc[:,['Reviewer_Location', 'Rating']] # With the : we get every row

          Reviewer_Location  Rating
0                 Australia       4
1               Philippines       4
2      United Arab Emirates       4
3                 Australia       4
4            United Kingdom       4
...                     ...     ...
42651        United Kingdom       5
42652                Canada       5
42653          South Africa       5
42654         United States       4
42655        United Kingdom       4

[42656 rows x 2 columns]

In [34]:
df.loc[[0],:] # I got the first row (0) with all their columns

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong

## Looking for data (iloc tool)

In [35]:
# We use iloc for get the columns by their index, not by their name, like...

df.iloc[[0,5,10],[0,2]] # I didn't have to put the name of the column, just the index of the same

    Review_ID Year_Month
0   670772142     2019-4
5   670591897     2019-4
10  670443403     2019-4

In [36]:
df.iloc[0:2,0:4] # I also can look for data without the double [],[]
# I just write the range for the row and the column separating with "," and then i'll get the data
# If i ask for data that doesn't exist, like column 100, but i only have 5, it'll only show the 5

   Review_ID  Rating Year_Month Reviewer_Location
0  670772142       4     2019-4         Australia
1  670682799       4     2019-5       Philippines

## Change indexex

In [37]:
# We also can change the index of the dataframe
df2 = pd.read_csv('Files/DisneylandReviews.csv', encoding="latin-1") # Create a dataframe again
df2.index = df2['Rating']
df2

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
Rating,,,,,,
4,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
4,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
4,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
4,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
5,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
5,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
5,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
4,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
4,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [38]:
# If we use the iloc, then we can access to the data with the number index

df2.iloc[0:2,0:3] # Still works because we used iloc, if we use loc, then
# It wouldn't work, because it would work with the Rating index

        Review_ID  Rating Year_Month
Rating
4       670772142       4     2019-4
4       670682799       4     2019-5

## Change values into the DF

In [39]:
df3 = pd.read_csv('Files/DisneylandReviews.csv', encoding="latin-1") # Create a new DF, to not change other actions
df3 # For example, i would like to change the Reviewer_Location in the index 3 for Colombia

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [40]:
df3.loc[3,["Reviewer_Location"]] = 'Colombia'
df3 # The data change was succesfully

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Colombia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

## Access to a special value

### at and iat it's designed to return only one value

In [41]:
df3.at[3,"Reviewer_Location"] # Then, we can use this function to get a value without a table format, just value

'Colombia'

In [42]:
# If I use the at method, I can get access with the same format [[Rows],[Name of columns]]
# But if we actually use iat then we can access to the value using the numeric value

df3.iat[3,3] # Its the same way, but using index values, we get the value without table format

'Colombia'

### Exercises locating data

In [43]:
# I'll search data that i see in the DF easily
df
# Rn i'll look for the 2nd and 4th row, Rating, Reviewer location and the Branch (table format)

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [ ]:
df.loc[[2,4],["Rating", "Reviewer_Location", "Branch"]] # There it is, i just got my data in table format

# Rn i want to get one value in a normal format (using at o iat)

   Rating     Reviewer_Location               Branch
2       4  United Arab Emirates  Disneyland_HongKong
4       4        United Kingdom  Disneyland_HongKong

In [ ]:
df.at[4,"Reviewer_Location"]

'United Kingdom'

In [ ]:
# Now i'll do the same thing but using the index value

df.iat[4,3] # Great

'United Kingdom'

## Access Data in column forms

In [61]:
# It's so easy, we only call the DF and tell wich column do we want to show in screen
df["Reviewer_Location"]

0                   Australia
1                 Philippines
2        United Arab Emirates
3                   Australia
4              United Kingdom
                 ...
42651          United Kingdom
42652                  Canada
42653            South Africa
42654           United States
42655          United Kingdom
Name: Reviewer_Location, Length: 42656, dtype: object

In [63]:
# Even we can call multiple columns using the next structure

# df[["Branch","Reviewer_Location"]]
df[["Branch","Reviewer_Location"]] # Even we can put the order as we want it to be 
# Like in this case: Branch first of Reviewer_Location

                    Branch     Reviewer_Location
0      Disneyland_HongKong             Australia
1      Disneyland_HongKong           Philippines
2      Disneyland_HongKong  United Arab Emirates
3      Disneyland_HongKong             Australia
4      Disneyland_HongKong        United Kingdom
...                    ...                   ...
42651     Disneyland_Paris        United Kingdom
42652     Disneyland_Paris                Canada
42653     Disneyland_Paris          South Africa
42654     Disneyland_Paris         United States
42655     Disneyland_Paris        United Kingdom

[42656 rows x 2 columns]